; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-7-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p3-1 - location
	p3-5 - location
	p3-6 - location
	p3-7 - location
	p4-3 - location
	p4-6 - location
	p5-4 - location
	p6-0 - location
	p7-2 - location
	p7-5 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s7)
	(at driver4 s7)
	(at driver5 s4)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s7)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s4)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s2)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s0)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at package1 s2)
	(at package2 s6)
	(at package3 s0)
	(at package4 s5)
	(at package5 s2)
	(at package6 s2)
	(at package7 s4)
	(at package8 s5)
	(at package9 s4)
	(at package10 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 94)
	(= (time-to-drive s1 s0) 94)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 60)
	(= (time-to-drive s7 s0) 60)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 20)
	(= (time-to-drive s3 s1) 20)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 18)
	(= (time-to-drive s7 s1) 18)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 20)
	(= (time-to-drive s0 s2) 20)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 53)
	(= (time-to-drive s1 s2) 53)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 75)
	(= (time-to-drive s4 s2) 75)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 60)
	(= (time-to-drive s5 s2) 60)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 3)
	(= (time-to-drive s2 s3) 3)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 8)
	(= (time-to-drive s0 s4) 8)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 69)
	(= (time-to-drive s5 s4) 69)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 76)
	(= (time-to-drive s1 s5) 76)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 46)
	(= (time-to-drive s3 s5) 46)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 97)
	(= (time-to-drive s6 s5) 97)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 93)
	(= (time-to-drive s0 s6) 93)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 55)
	(= (time-to-drive s1 s6) 55)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 16)
	(= (time-to-drive s3 s6) 16)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 19)
	(= (time-to-drive s4 s6) 19)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 95)
	(= (time-to-drive s3 s7) 95)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 62)
	(= (time-to-drive s4 s7) 62)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 42)
	(= (time-to-drive s5 s7) 42)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver3 s4)
	(at driver5 s1)
	(at truck1 s5)
	(at truck2 s7)
	(at truck5 s4)
	(at truck7 s6)
	(at package1 s6)
	(at package2 s5)
	(at package3 s1)
	(at package4 s7)
	(at package5 s2)
	(at package6 s1)
	(at package7 s2)
	(at package9 s1)
	(at package10 s1)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver5 truck5 s4)
   deleted: (at driver5 s4) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 3 of 16
2. (load-truck package7 truck5 s4)
   deleted: (at package7 s4)
   added: (in package7 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 3 of 16
3. (load-truck package9 truck5 s4)
   deleted: (at package9 s4)
   added: (in package9 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 3 of 16
4. (drive-truck truck5 s4 s6 driver5)
   deleted: (at truck5 s4)
   added: (at truck5 s6)
   changed: (fuel-used) from 0 to 247
   goals met: 2 of 16
5. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   goals met: 2 of 16
6. (load-truck package2 truck5 s6)
   deleted: (at package2 s6)
   added: (in package2 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 2 of 16
7. (drive-truck truck5 s6 s4 driver5)
   deleted: (at truck5 s6)
   added: (at truck5 s4)
   changed: (fuel-used) from 247 to 551
   goals met: 3 of 16
8. (walk driver1 p0-2 s2)
   deleted: (at driver1 p0-2)
   added: (at driver1 s2)
   goals met: 4 of 16
9. (drive-truck truck5 s4 s5 driver5)
   deleted: (at truck5 s4)
   added: (at truck5 s5)
   changed: (fuel-used) from 551 to 1655
   goals met: 3 of 16
10. (load-truck package10 truck5 s5)
   deleted: (at package10 s5)
   added: (in package10 truck5)
   changed: (load truck5) from 3 to 4, (fuel-per-minute truck5) from 16 to 20
   goals met: 3 of 16
11. (unload-truck package2 truck5 s5)
   deleted: (in package2 truck5)
   added: (at package2 s5)
   changed: (load truck5) from 4 to 3, (fuel-per-minute truck5) from 20 to 16
   goals met: 4 of 16
12. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 3 of 16
13. (drive-truck truck2 s2 s1 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 1655 to 2185
   goals met: 3 of 16
14. (load-truck package4 truck5 s5)
   deleted: (at package4 s5)
   added: (in package4 truck5)
   changed: (load truck5) from 3 to 4, (fuel-per-minute truck5) from 16 to 20
   goals met: 3 of 16
15. (drive-truck truck5 s5 s4 driver5)
   deleted: (at truck5 s5)
   added: (at truck5 s4)
   changed: (fuel-used) from 2185 to 3565
   goals met: 4 of 16
16. (drive-truck truck5 s4 s0 driver5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   changed: (fuel-used) from 3565 to 3725
   goals met: 3 of 16
17. (load-truck package3 truck5 s0)
   deleted: (at package3 s0)
   added: (in package3 truck5)
   changed: (load truck5) from 4 to 5, (fuel-per-minute truck5) from 20 to 25
   goals met: 3 of 16
18. (drive-truck truck2 s1 s7 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (fuel-used) from 3725 to 3905
   goals met: 4 of 16
19. (disembark-truck driver1 truck2 s7)
   deleted: (driving driver1 truck2)
   added: (at driver1 s7) (empty truck2)
   goals met: 4 of 16
20. (walk driver1 s7 p7-2)
   deleted: (at driver1 s7)
   added: (at driver1 p7-2)
   goals met: 4 of 16
21. (walk driver1 p7-2 s2)
   deleted: (at driver1 p7-2)
   added: (at driver1 s2)
   goals met: 5 of 16
22. (drive-truck truck5 s0 s1 driver5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (fuel-used) from 3905 to 6255
   goals met: 5 of 16
23. (walk driver2 s1 p0-1)
   deleted: (at driver2 s1)
   added: (at driver2 p0-1)
   goals met: 5 of 16
24. (unload-truck package9 truck5 s1)
   deleted: (in package9 truck5)
   added: (at package9 s1)
   changed: (load truck5) from 5 to 4, (fuel-per-minute truck5) from 25 to 20
   goals met: 6 of 16
25. (walk driver2 p0-1 s0)
   deleted: (at driver2 p0-1)
   added: (at driver2 s0)
   goals met: 6 of 16
26. (unload-truck package3 truck5 s1)
   deleted: (in package3 truck5)
   added: (at package3 s1)
   changed: (load truck5) from 4 to 3, (fuel-per-minute truck5) from 20 to 16
   goals met: 7 of 16
27. (board-truck driver2 truck7 s0)
   deleted: (at driver2 s0) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 7 of 16
28. (drive-truck truck7 s0 s6 driver2)
   deleted: (at truck7 s0)
   added: (at truck7 s6)
   changed: (fuel-used) from 6255 to 7185
   goals met: 8 of 16
29. (drive-truck truck5 s1 s2 driver5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (fuel-used) from 7185 to 8033
   goals met: 8 of 16
30. (board-truck driver3 truck2 s7)
   deleted: (at driver3 s7) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 16
31. (load-truck package1 truck5 s2)
   deleted: (at package1 s2)
   added: (in package1 truck5)
   changed: (load truck5) from 3 to 4, (fuel-per-minute truck5) from 16 to 20
   goals met: 8 of 16
32. (unload-truck package7 truck5 s2)
   deleted: (in package7 truck5)
   added: (at package7 s2)
   changed: (load truck5) from 4 to 3, (fuel-per-minute truck5) from 20 to 16
   goals met: 9 of 16
33. (load-truck package6 truck5 s2)
   deleted: (at package6 s2)
   added: (in package6 truck5)
   changed: (load truck5) from 3 to 4, (fuel-per-minute truck5) from 16 to 20
   goals met: 9 of 16
34. (drive-truck truck5 s2 s1 driver5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   changed: (fuel-used) from 8033 to 9093
   goals met: 9 of 16
35. (unload-truck package6 truck5 s1)
   deleted: (in package6 truck5)
   added: (at package6 s1)
   changed: (load truck5) from 4 to 3, (fuel-per-minute truck5) from 20 to 16
   goals met: 10 of 16
36. (unload-truck package10 truck5 s1)
   deleted: (in package10 truck5)
   added: (at package10 s1)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 11 of 16
37. (drive-truck truck2 s7 s4 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s4)
   changed: (fuel-used) from 9093 to 9713
   goals met: 10 of 16
38. (drive-truck truck5 s1 s7 driver5)
   deleted: (at truck5 s1)
   added: (at truck5 s7)
   changed: (fuel-used) from 9713 to 9947
   goals met: 10 of 16
39. (unload-truck package4 truck5 s7)
   deleted: (in package4 truck5)
   added: (at package4 s7)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 11 of 16
40. (drive-truck truck5 s7 s1 driver5)
   deleted: (at truck5 s7)
   added: (at truck5 s1)
   changed: (fuel-used) from 9947 to 10145
   goals met: 11 of 16
41. (drive-truck truck5 s1 s6 driver5)
   deleted: (at truck5 s1)
   added: (at truck5 s6)
   changed: (fuel-used) from 10145 to 10750
   goals met: 11 of 16
42. (unload-truck package1 truck5 s6)
   deleted: (in package1 truck5)
   added: (at package1 s6)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 12 of 16
43. (drive-truck truck2 s4 s7 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s7)
   changed: (fuel-used) from 10750 to 11370
   goals met: 13 of 16
44. (drive-truck truck5 s6 s4 driver5)
   deleted: (at truck5 s6)
   added: (at truck5 s4)
   changed: (fuel-used) from 11370 to 11560
   goals met: 14 of 16
45. (disembark-truck driver2 truck7 s6)
   deleted: (driving driver2 truck7)
   added: (at driver2 s6) (empty truck7)
   goals met: 14 of 16
46. (disembark-truck driver3 truck2 s7)
   deleted: (driving driver3 truck2)
   added: (at driver3 s7) (empty truck2)
   goals met: 14 of 16
47. (board-truck driver3 truck3 s7)
   deleted: (at driver3 s7) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 14 of 16
48. (disembark-truck driver5 truck5 s4)
   deleted: (driving driver5 truck5)
   added: (at driver5 s4) (empty truck5)
   goals met: 14 of 16
49. (drive-truck truck3 s7 s4 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   changed: (fuel-used) from 11560 to 12180
   goals met: 14 of 16
50. (disembark-truck driver3 truck3 s4)
   deleted: (driving driver3 truck3)
   added: (at driver3 s4) (empty truck3)
   goals met: 15 of 16
51. (walk driver5 s4 p4-3)
   deleted: (at driver5 s4)
   added: (at driver5 p4-3)
   goals met: 15 of 16
52. (walk driver5 p4-3 s3)
   deleted: (at driver5 p4-3)
   added: (at driver5 s3)
   goals met: 15 of 16
53. (walk driver5 s3 p3-1)
   deleted: (at driver5 s3)
   added: (at driver5 p3-1)
   goals met: 15 of 16
54. (walk driver5 p3-1 s1)
   deleted: (at driver5 p3-1)
   added: (at driver5 s1)
   goals met: 16 of 16
